/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   sb.c                                               :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: xuwang <xuwang@student.42.fr>              +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2021/05/14 18:46:38 by xuwang            #+#    #+#             */
/*   Updated: 2021/05/14 18:58:06 by xuwang           ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

// swap b - intervertit les 2 premiers éléments au sommet de la pile b. Ne fait rien s’il n’y en a qu’un ou aucun.
// 交换 b 栈最顶部的两个元素（【0】，【1】）如果是0或者1个元素则不运行